lilypond_compilation_issues.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-06-17 Sat 20:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lilypond Compilation Issues</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./project_log.html"> UP </a>
 |
 <a accesskey="H" href="./project_log.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Lilypond Compilation Issues</h1>
<p>
I'm using lilypond as a means to dive into music theory and to
inscribe an assortment of music (some songs that I've written, some
written by my father, some written by others).  I also opted to check
out the source to poke around, but when I tried to transform one of
the examples provided with the source code with my installed copy it
threw a range of errors, presumably because the version installed by
my package manager was out of date with trunk. To remove this variable
I opted to use an executable compiled from the checked out source, but
compilation did not go smoothly.
</p>

<p>
The first not real issue was getting the proper dependencies loaded
where I'd somewhat assumed that they would be present by virtue of the
previously installed version, but I seemed to be missing some Cyrillic
TeX fonts that were either not previously used or were a disabled
option, but in any case I just installed the package and the
configuration step proceeded without issue&#x2026;but the compilation
failed.
</p>

<p>
The build threw errors around cairo linking with PNG.
</p>

<pre class="example">
/usr/lib/gcc/x86_64-pc-linux-gnu/12/../../../../x86_64-pc-linux-gnu/bin/ld: ./out/cairo.o: undefined reference to symbol 'png_image_write_to_file@@PNG16_0'
/usr/lib/gcc/x86_64-pc-linux-gnu/12/../../../../x86_64-pc-linux-gnu/bin/ld: /usr/lib64/libpng16.so.16: error adding symbols: DSO missing from command line
collect2: error: ld returned 1 exit status
make[1]: *** [GNUmakefile:42: out/lilypond] Error 1
make: *** [make/generic-targets.make:6: all] Error 2
</pre>

<p>
Using <code>make --no-silent</code> so that it echoed the commands I
noticed that there was no relevant linker flag so I explicitly
populate the relevant environment variables with the <code>pkg-config</code>
output and tried the configure/build dance again to blow up on <span class="underline">other</span>
errors.
</p>

<p>
A this point I've noticed that while many of the dependencies are
being detected there seems to be no parameters populated from <code>pkg-config</code>
in <code>config.log</code>. I'd wonder if this may not be a practical concern,
but it seemed to help in the PNG case so feels worth deeper inspection
if this issue persists.
</p>

<p>
From what I've started to incidentally pick through the Lilypond build
process feels fairly primitive which means that it should both be
fairly easy to pick through but also fairly likely to suffer from a
potentially obscure issue with sparse readily available information.
</p>

<p>
Unfortunately lilypond references an <code>INSTALL.txt</code> file which doesn't
seem to exist in my working directory and I'm currently having issues
accessing the online compilation guide.
</p>

<p>
Attempting to rerun <code>autogen.sh</code> seems potentially promising as that
populates some of the values for PNG in the logs&#x2026;
</p>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-06-17 Sat 20:41</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>